tutorials/Hjunction3D-Link/constant/inputParameters
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
   This file contains all of the necessary input parameters used in coagFoam.
   All of the
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      inputParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* ------------------------------------------------------------------------- *\
   Geometry and Mesh Parameters
\*---------------------------------------------------------------------------*/
// Geometry parameters (all in cm see convertToMeters above)
w_chan 100.0e-3; // width vertical channel 
h_chan 60.0e-3; // height of the vertical channel
l_chan 170.e-3; // length of the vertical channel

w_inj 20.0e-3; // width of injury channel
h_inj 60.0e-3; // height of injury channel
l_inj 150.0e-3; // length of injury channel

// Number of Cells by Region
NxMid 60; // # of cells in x-dir of injury channel (dx = 2.5 microns)
NyMid 8; // # of cells in y-dir of the injury channel (dy = 2.5 microns)
NzMid 16; // # of cells in z-dir of injury (dz = 2.5 microns) 

NxLegs 15; // # of cells in x-dir of each vertical channel
NyLegs 44; // # of cells in y-dir of each vertical channel
Nz $NzMid; // # of cells in z-dir of each vertical channel 

// Grading parameters for each block
RxLegsLeft 4.045;
RxLegsRight 0.247;
Rx_inj 1;
RyLegsLow 0.2889062367;
RyLegsUp 2.134528967;
Ry_inj 1;
Rz_back 2.118896081;
Rz_front 0.4719568732;
Rz_inj 1;


/* ------------------------------------------------------------------------- *\
   Fluid Parameters
\*---------------------------------------------------------------------------*/
nu 2.62507; // kinematic viscosity of fluid [mm^2 / s]
C_CK 1.0e+06; // Carman-Kozeny relation constant [1 / mm^2]
Q_left 1.17e-02; // Left inlet volumetric flowrate [mm^3 / s]
Q_right 9.32e-02; // Right inlet volumetric flowrate [mm^3 / s]

/* ------------------------------------------------------------------------- *\
   Pressure Parameters (kinematic pressure)
\*---------------------------------------------------------------------------*/
PL0 1110.0e+03; // Left outlet kinematic pressure [mm^2 / s^2]
PR0 1780.0e+03; // Right outlet kinematic pressure [mm^2 / s^2]

/* ------------------------------------------------------------------------- *\
   Platelet Parameters
\*---------------------------------------------------------------------------*/
num_plts 4; // Total Number of platelet species (Integer)
num_plts_mobile 2; // Number of mobile platelet species (for transport solve)
M_rxn 2; // Number of time steps for reactions solve: h_react = dt / M_react
Pdiam 3e-03; // Diameter of one platelet [mm]
Pmax 6.67e+07; // Maxiumum packing density [1 / mm^3]
Dp 2.5e-05; // Diffusion rate for platelets [mm^2 / s]
Plt_0 2.5e+05; // Mobile platelet inlet number density [1 / mm^3]
t0_Plt 0.0; // When the platelets start to enter the domain
tf_Plt 0.01; // When the platelets reach Plt_0 at inlet

// Platelet Adhesion Params
kAdh 3.3212e-08; // rate of adhesion [mm^3 / s]

// Platelet Cohesion Params
kCohPmax 1.0e+4; // Cohesion constant times Pmax [1/s]
eta_t 0.1; // threshold value for g(eta) [nondim]
eta_ast 0.4; // eta_ast_val + eta_t_val = 0.25 - 0.75 [nondim]
l_D_eta #calc "2.0*$Pdiam"; // length of "diffusion" for eta [mm]

// Platelet Activation Params
kADP_Pla 0.34; // Platelet activation rate by ADP [1/s]
kE2_Pla 0.5; // Platelet activation rate by thrombin [1/s]
ADP_ast 2.0e-03; // Critical concentration of ADP [nanomol / mm^3]
E2_ast 1.0e-06; // Critical concentration of thrombin [nanomol / mm^3]

/* ------------------------------------------------------------------------- *\
   ADP Parameters
\* ------------------------------------------------------------------------- */
D_ADP 5.0e-04; // Diffusion rate for ADP [mm^2 / s]
ADP_rel 2.0e-08; // Total ADP released [nanomol/platlet]
sigma_dt 0.25; // How often the sigma_release function is calculated [s]
sigma_Tf 6; // How far back the integration goes for sigma_release [s]

/* ------------------------------------------------------------------------- *\
   Chemical Reaction Parameters
\*---------------------------------------------------------------------------*/
num_seBound 2; // Number of SE-bound chem. species (integer)
num_fluidPhase 4; // Number of fluid-phase chem. species (integer)
num_pltBound 6; // Number of platelet-bound chem. species (integer)

t0_chem $t0_Plt; // When the chemicals start to enter the domain
tf_chem $tf_Plt; // When the chemicals reach their full IC at inlet

// Avogadro's Constant
N_Avo 6.02214076e+14; // [1 / nanomol]

// Diffusion rate for fluidPhase chemicals
Dc 5.0e-05; // [mm^2/s]

// Initial concentrations
E0_IC 1.5e-07; // Concentration of E0 on SE Wall [nanomol / mm^2]
S1_IC 1.7e-04; // Concentration of S1 at inlet [nanomol / mm^3]
S2_IC 1.4e-03; // Concentration of S2 at inlet [nanomol / mm^3]

// Number of binding sites on platelet surface for specific chems
N_1 2700.0;
N_2 2000.0;

// Kinetic Rates
kC0_on 8.95e+03; // On-rate for C0 [mm^3 / nanomol / s]
kC0_off 1.0; // Off-rate for C0 [1/s]
kC0_cat 1.15; // Cat-rate for C0 [1/s]

kC1_on 1.03e+05; // On-rate for C1 [mm^3 / nanomol / s]
kC1_off 1.0; // Off-rate for C1 [1/s]
kC1_cat 30; // Cat-rate for C1 [1/s]

kC2_on 1.73e+04; //  On-rate for C2 [mm^3 / nanomol / s]
kC2_off 1.0;     // Off-rate for C2 [1/s]
kC2_cat 0.23;    // Cat-rate for C2 [1/s]

kE1_on 1.0e+04;  //  On-rate for Xa [mm^3 / nanomol / s]
kE1_off 2.5e-02; // Off-rate for Xa [1/s]

kE2_on 1.0e+04;  //  On-rate for IIa [mm^3 / nanomol / s]
kE2_off 5.9; // Off-rate for IIa [1/s]

kS1_on 5.7e+04; // On-rate for FV [mm^3 / nanomol / s]
kS1_off 0.17; // Off-rate for FV [1/s]

kS2_on 1.0e+04; // On-rate for II [mm^3 / nanomol / s]
kS2_off 5.9; // Off-rate for II [1/s]

/* ------------------------------------------------------------------------- *\
   Other lengths used by multiple files (DON'T EDIT!!!!!)
\*---------------------------------------------------------------------------*/
w_chan_pls_l_inj #calc "$w_chan + $l_inj"; // width of (left channel) + (injury channel)
l_legs #calc "($l_chan - $w_inj) / 2.0"; // length of lower and upper legs of H 
l_legs_pls_w_inj #calc "$l_legs + $w_inj"; // height of (lower legs) + (injury channel)
z1_inj #calc "($h_chan - $h_inj) / 2.0"; // back of injury channel
z2_inj #calc "$z1_inj + $h_inj"; // front of injury channel
// ************************************************************************* //
